renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/src/boot_loader.c
            }
            if(FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("NG\r\n");
                printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            secure_boot_error_code = BOOT_LOADER_GOTO_INSTALL;
            break;
        case LIFECYCLE_STATE_UPDATING:
            printf("update data flash\r\n");
            memcpy(hash_sha1, firmware_update_control_block_image.data.program_hash1, sizeof(hash_sha1));
            memcpy(firmware_update_control_block_image.data.program_hash1, firmware_update_control_block_image.data.program_hash0, sizeof(hash_sha1));
            memcpy(firmware_update_control_block_image.data.program_hash0, hash_sha1, sizeof(hash_sha1));
            firmware_update_control_block_image.data.lifecycle_state = LIFECYCLE_STATE_ON_THE_MARKET;

            R_Sha1((uint8_t *)&firmware_update_control_block_image.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
            memcpy(firmware_update_control_block_image.hash_sha1, hash_sha1, sizeof(hash_sha1));
            update_dataflash_data_from_image();
            update_dataflash_data_mirror_from_image();
            //break;    /* in this case, next state "LIFECYCLE_STATE_ON_THE_MARKET" is needed to execute */
        case LIFECYCLE_STATE_ON_THE_MARKET:
            check_dataflash_area(0);
            printf("code flash hash check...");
            R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
            if(!memcmp(firmware_update_control_block_data.data.program_hash0, hash_sha1, sizeof(hash_sha1)) || !memcmp(firmware_update_control_block_data.data.program_hash1, hash_sha1, sizeof(hash_sha1)))
            {
                printf("OK\r\n");
                printf("jump to user program\r\n");
                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                secure_boot_error_code = BOOT_LOADER_SUCCESS;
            }
            else
            {
                R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                if(!memcmp(firmware_update_control_block_data.data.program_hash0, hash_sha1, sizeof(hash_sha1)) || !memcmp(firmware_update_control_block_data.data.program_hash1, hash_sha1, sizeof(hash_sha1)) )
                {
                    printf("NG.\r\n");
                    printf("But other bank %d is still alive.\r\n", (bank_info ^ 0x01) ^ 0x01);
                    printf("swap bank...");
                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                    bank_swap_with_software_reset();
                    while(1);
                }
                else
                {
                    printf("NG.\r\n");
                    printf("Code flash is completely broken.\r\n");
                    printf("Please erase all code flash.\r\n");
                    printf("And, write secure boot using debugger.\r\n");
                    secure_boot_error_code = BOOT_LOADER_FAIL;
                }
            }
            break;
        default:
            printf("illegal flash rom status code 0x%x.\r\n", firmware_update_control_block_image.data.lifecycle_state);
            check_dataflash_area(0);
            R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
            software_reset();
            while(1);
    }
    return secure_boot_error_code;
}

static void update_dataflash_data_from_image(void)
{
    uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
    if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
    {
        required_dataflash_block_num++;
    }

    printf("erase dataflash(main)...");
    flash_error_code = R_FLASH_Erase((flash_block_address_t)&firmware_update_control_block_data, required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
    }

    printf("write dataflash(main)...");
    flash_error_code = R_FLASH_Write((flash_block_address_t)&firmware_update_control_block_image, (flash_block_address_t)&firmware_update_control_block_data, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
        return;
    }
    return;
}

static void update_dataflash_data_mirror_from_image(void)
{
    uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
    if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
    {
        required_dataflash_block_num++;
    }

    printf("erase dataflash(mirror)...");
    flash_error_code = R_FLASH_Erase((flash_block_address_t)&firmware_update_control_block_data_mirror, required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
        return;
    }

    printf("write dataflash(mirror)...");
    flash_error_code = R_FLASH_Write((flash_block_address_t)&firmware_update_control_block_image, (flash_block_address_t)&firmware_update_control_block_data_mirror, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
        return;
    }
    if(!memcmp(&firmware_update_control_block_data, &firmware_update_control_block_data_mirror, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK)))
    {
        printf("data flash setting OK.\r\n");
    }
    else
    {
        printf("data flash setting NG.\r\n");
        return;
    }
    return;
}

static void check_dataflash_area(uint32_t retry_counter)
{
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];

    if(retry_counter)
    {
        printf("recover retry count = %d.\r\n", retry_counter);
        if(retry_counter == MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT)
        {
            printf("retry over the limit.\r\n");
            while(1);
        }
    }
    printf("data flash(main) hash check...");
    R_Sha1((uint8_t *)&firmware_update_control_block_data.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
    if(!memcmp(firmware_update_control_block_data.hash_sha1, hash_sha1, sizeof(hash_sha1)))
    {
        printf("OK\r\n");
        printf("data flash(mirror) hash check...");
        R_Sha1((uint8_t *)&firmware_update_control_block_data_mirror.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
        if(!memcmp(firmware_update_control_block_data_mirror.hash_sha1, hash_sha1, sizeof(hash_sha1)))
        {
            printf("OK\r\n");
        }
        else
        {
            printf("NG\r\n");
            printf("recover mirror from main.\r\n");
            memcpy(&firmware_update_control_block_image, &firmware_update_control_block_data, sizeof(firmware_update_control_block_data));
            update_dataflash_data_mirror_from_image();
            check_dataflash_area(retry_counter+1);
        }
    }
    else
    {
        printf("NG\r\n");
        printf("data flash(mirror) hash check...");
        R_Sha1((uint8_t *)&firmware_update_control_block_data_mirror.data, hash_sha1, sizeof(firmware_update_control_block_data_mirror.data));
        if(!memcmp(firmware_update_control_block_data_mirror.hash_sha1, hash_sha1, sizeof(hash_sha1)))
        {
            printf("OK\r\n");
            printf("recover main from mirror.\r\n");
            memcpy(&firmware_update_control_block_image, &firmware_update_control_block_data_mirror, sizeof(firmware_update_control_block_data_mirror));
            update_dataflash_data_from_image();
            check_dataflash_area(retry_counter+1);
        }
        else
        {
            printf("NG\r\n");
            printf("Data flash is completely broken.\r\n");
            printf("Please erase all code flash.\r\n");
            printf("And, write secure boot using debugger.\r\n");
            while(1);
        }
    }
}

