renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/src/boot_loader.c
static void software_reset(void)
{
    R_BSP_InterruptsDisable();
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while(1);   /* software reset */
}

static void bank_swap_with_software_reset(void)
{
    R_BSP_InterruptsDisable();
    R_FLASH_Control(FLASH_CMD_BANK_TOGGLE, NULL);
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while(1);   /* software reset */
}


/***********************************************************************************************************************
* Function Name: firm_block_read
* Description  : Does an example task. Making this longer just to see how it wraps. Making this long just to see how it
*                wraps.
* Arguments    : index -
*                    Where to start looking
*                p_output -
*                    Pointer of where to put the output data
* Return Value : count -
*                    How many entries were found
***********************************************************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{
    FRESULT ret = TFAT_FR_OK;
    uint8_t buf[256] = {0};
    uint8_t arg1[256] = {0};
    uint8_t arg2[256] = {0};
    uint8_t arg3[256] = {0};
    uint16_t size = 0;
    FIL file = {0};
    uint32_t read_size = 0;
    static uint32_t upprogram[4 + 1] = {0};
    static uint32_t current_char_position = 0;
    static uint32_t current_file_position = 0;
    static uint32_t previous_file_position = 0;

    if (0 == offset)
    {
        current_char_position = 0;
        current_file_position = 0;
        previous_file_position = 0;
        memset(upprogram,0,sizeof(upprogram));
    }

    ret = R_tfat_f_open(&file, INITIAL_FIRMWARE_FILE_NAME, TFAT_FA_READ | TFAT_FA_OPEN_EXISTING);
    if (TFAT_RES_OK == ret)
    {
        current_char_position = 0;
        memset(buf, 0, sizeof(buf));

        R_tfat_f_lseek(&file, previous_file_position);
        if (TFAT_RES_OK == ret)
        {
            while(1)
            {
                ret = R_tfat_f_read(&file, &buf[current_char_position++], 1, &size);
                if (TFAT_RES_OK == ret)
                {
                    if (0 == size)
                    {
                        break;
                    }
                    else
                    {
                        previous_file_position += size;

                        /* received 1 line */
                        if(strstr((char*)buf, "\r\n"))
                        {
                            sscanf((char*)buf, "%256s %256s %256s", (char*)arg1, (char*)arg2, (char*)arg3);
                            if (!strcmp((char *)arg1, "sha1"))
                            {
                                base64_decode(arg2, (uint8_t *)load_firmware_control_block.hash_sha1, strlen((char *)arg2));
                            }
                            if (!strcmp((char *)arg1, "max_cnt"))
                            {
                                sscanf((char*) arg2, "%x", load_firmware_control_block.firmware_length);
                            }
                            if (!strcmp((char *)arg1, "upprogram"))
                            {
                                base64_decode(arg3, (uint8_t *)upprogram, strlen((char *)arg3));
                                memcpy(&firmware[current_file_position], upprogram, 16);
                                current_file_position += 4;
                                read_size += 16;
                            }
                            if((current_file_position * 4) == FLASH_CF_MEDIUM_BLOCK_SIZE)
                            {
                                current_file_position = 0;
                                break;
                            }
                            current_char_position = 0;
                            memset(buf, 0, sizeof(buf));
                        }
                    }
                }
                else
                {
                    goto firm_block_read_error;
                    break;
                }
            }
        }
        else
        {
            goto firm_block_read_error;
        }
        if (TFAT_RES_OK == ret)
        {
            ret = R_tfat_f_close(&file);
            if (TFAT_RES_OK != ret)
            {
                goto firm_block_read_error;
            }
        }
    }
    else
    {
firm_block_read_error:
        return -1;
    }
    return 0;
}
